//?можно ли переопределить инлайновый стиль?

//* да, можно. Через директиву !important

//? есть ли у html тегов дефолтные стили?

//* да, есть. Например h, p, b и тд предназначены для стилизации и выделения текста. Заголовки меняют толщину букв, имеют margin и тд..

//? для чего нужен alt?

//* для того чтобы при невозвможности загрузки изображения отобразить альтернативу и для большей доступности для
//* screen-reader

//? DISPLAY: NONE | HIDDEN

//* none - элемент удаляется из разметки, hidden - не виден, но занимает выделенное ему место
